ch9/ch9-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-01 Wed 10:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 9.1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pedh" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content">
<h1 class="title">Chapter 9.1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3afedab">ch9.1</a>
<ul>
<li><a href="#org168d848">9.1-1</a></li>
<li><a href="#org17928f1">9.1-2</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3afedab" class="outline-2">
<h2 id="org3afedab">ch9.1</h2>
<div class="outline-text-2" id="text-org3afedab">
</div>
<div id="outline-container-org168d848" class="outline-3">
<h3 id="org168d848">9.1-1</h3>
<div class="outline-text-3" id="text-org168d848">
<p>
First we build a binary tree to find the smallest element, we split the n
elements to \(\lceil n / 2 \rceil\) pairs and put them in the bottom of the
tree, then we compare the elements of each pair and make the smaller one to
be the parent node of the pair, we keep doing the reduction until we reach
the top of the tree, then we find the smallest element, the number of
comparisons is \(n - 1\).
</p>

<p>
Then we consider about the second smallest element, the second smallest
element must have been compared to the smallest element in the first step,
we trace the path of the smallest element in the tree, the smallest element
of the elements who have been compared to the smallest element, is the second
smallest element, and the number of comparisons we need in this step is at
most \(\lceil \lg n \rceil - 1\).
</p>

<p>
The total number of comparisons is at most \(n + \lceil \lg n \rceil - 2\).
</p>

<p>
(<a href="../codes/second_smallest_element.py">implementation</a>)
</p>
</div>
</div>
<div id="outline-container-org17928f1" class="outline-3">
<h3 id="org17928f1">9.1-2</h3>
<div class="outline-text-3" id="text-org17928f1">
<p>
Let \(S_{max}\) be the set of numbers which are potentially the maximum, and
\(S_{min}\) be the set of numbers which are potentially the minimum. At the
beginning, both \(S_{max}\) and \(S_{min}\) contain all \(n\) numbers.
</p>

<p>
After each comparison of two number \(a\) and \(b\), if \(a \geq b\), we can
remove \(a\) from \(S_{min}\) if \(a \in S_{min}\), and remove \(b\) from
\(S_{max}\) if \(b \in S_{max}\).
</p>

<p>
In the best case, we first take \(\lfloor n / 2 \rfloor\) comparisons, to
reduce the sizes of \(S_{max}\) and \(S_{min}\) to \(\lfloor n / 2 \rfloor\)
and \(\lceil n / 2 \rceil\), then we take
\(\lfloor n / 2 \rfloor - 1 + \lceil n / 2 \rceil - 1 = n / 2 - 2\)
comparisons to get the maximum and minimum, by comparing the numbers in
\(S_{max}\) and comparing the numbers in \(S_{min}\), the total number of
comparisons is \(\lfloor n/2 \rfloor + n/2 - 2 = \lfloor 3n/2 \rfloor - 2\).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2020-07-01 Wed 10:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
